---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.CenterlineLength
source: html/ef7e4df9-2b73-929d-622d-6c6fad172e36.htm
---
# Autodesk.Revit.DB.FabricationPart.CenterlineLength Property

The centerline length of the fabrication part.

## Syntax (C#)
```csharp
public double CenterlineLength { get; }
```